src/tests/performance-test.yml
#
# Requires artillery.io been installed.
#
config:
  target: "http://localhost:80"
  phases:
  - duration: 20 # The duration of spawning new virtual users.
    arrivalRate: 2 # The average number of virtual users pr. sec.
scenarios:
- name: "Simulate a very fast user (100 WPM)"
  weight: 8 # Average of 8% of all users
  engine: "socketio" # Use socketio connection
  flow:
  - get:
      url: "/" #  HTTP GET request
  - emit:
      channel: "getText" # The event to send to the server
      namespace: "/collab" # The namespace for the socket (This is defined by the server)
  - think: 5
  - loop: # Loop the sendText event
    - emit:
        channel: "sendText"
        data: >
          {"action":"insert","positionStart":{"row":0,"column":0},"content":["u\n"],"positionEnd":{"row":0,"column":1}}
        namespace: "/collab"
    - think: 0.120 # Wait X seconds before sending new data
    count: 500 # Simulate X amount of character sent
- name: "Simulate a fast user (50 WPM)"
  weight: 12 # Average of 12% of all users
  engine: "socketio" # Use socketio connection
  flow:
  - get:
      url: "/" # HTTP GET request
  - emit:
      channel: "getText" # The event to send to the server
      namespace: "/collab" # The namespace for the socket (This is defined by the server)
  - think: 5
  - loop: # Loop the sendText event
    - emit:
        channel: "sendText"
        data: >
          {"action":"insert","positionStart":{"row":0,"column":0},"content":["f\n"],"positionEnd":{"row":0,"column":1}}
        namespace: "/collab"
    - think: 0.240 # Wait X seconds before sending new data
    count: 250 # Simulate X amount of character sent
- name: "Simulate an average user (25 WPM)"
  weight: 30 # Average of 30% of all users
  engine: "socketio"
  flow:
  - get:
      url: "/" # HTTP GET request
  - emit:
      channel: "getText" # The event to send to the server
      namespace: "/collab" # The namespace for the socket (This is defined by the server)
  - think: 5
  - loop: # Loop the sendText event
    - emit:
        channel: "sendText"
        data: >
          {"action":"insert","positionStart":{"row":0,"column":0},"content":["a\n"],"positionEnd":{"row":0,"column":1}}
        namespace: "/collab"
    - think: 0.480 # Wait X seconds before sending new data
    count: 125 # Simulate X amount of character sent
- name: "Simulate a slow user (10 WPM)"
  weight: 50 # Average of 50% of all users
  engine: "socketio" # Use socketio connection
  flow:
  - get:
      url: "/" # HTTP GET request
  - emit:
      channel: "getText" # The event to send to the server
      namespace: "/collab" # The namespace for the socket defined by the server
  - think: 5
  - loop: # Loop the sendText event
    - emit:
        channel: "sendText"
        data: >
          {"action":"insert","positionStart":{"row":0,"column":0},"content":["s\n"],"positionEnd":{"row":0,"column":1}}
        namespace: "/collab"
    - think: 1.2 # Wait X seconds before sending new data
    count: 100 # Simulate X amount of character sent